app/views/visa_applications/new.html.erb


  <% VisaApplicationForm.find(1).steps.each do |step| %>
---
SELECT  "visa_application_forms".* FROM "visa_application_forms" WHERE "visa_application_forms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "steps".* FROM "steps" INNER JOIN "visa_application_form_steps" ON "steps"."id" = "visa_application_form_steps"."step_id" WHERE "visa_application_form_steps"."visa_application_form_id" = ?  [["visa_application_form_id", 1]]


    <% step.questions.each do |question| %>
---
SELECT "questions".* FROM "questions" INNER JOIN "step_questions" ON "questions"."id" = "step_questions"."question_id" WHERE "step_questions"."step_id" = ?  [["step_id", 1]]