app/controllers/landings_controller.rb

SELECT "landings".* FROM "landings"
---
  def index
    @landings = Landing.all