app/controllers/navbars_controller.rb

  def index
    @navbars = Navbar.all
---
SELECT "navbars".* FROM "navbars"