app/controllers/step_questions_controller.rb

SELECT "step_questions".* FROM "step_questions"
---
  def index
    @step_questions = StepQuestion.all

INSERT INTO "step_questions" ("step_id", "question_id", "position", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["step_id", 1], ["question_id", 1], ["position", 1], ["created_at", "2018-12-07 08:54:11.483814"], ["updated_at", "2018-12-07 08:54:11.483814"]]
---
  def create
    @step_question = StepQuestion.new(step_question_params)

    respond_to do |format|
      if @step_question.save

SELECT  "step_questions".* FROM "step_questions" WHERE "step_questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_step_question
      @step_question = StepQuestion.find(params[:id])