app/controllers/steps_controller.rb

  def index
    @steps = Step.all
---
SELECT "steps".* FROM "steps"

  def create
    @step = Step.new(step_params)

    respond_to do |format|
      if @step.save
---
INSERT INTO "steps" ("position", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["position", 1], ["title", "First step"], ["created_at", "2018-12-07 08:53:27.943051"], ["updated_at", "2018-12-07 08:53:27.943051"]]

    def set_step
      @step = Step.find(params[:id])
---
SELECT  "steps".* FROM "steps" WHERE "steps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]