app/controllers/visa_application_forms_controller.rb

SELECT "visa_application_forms".* FROM "visa_application_forms"
---
  def index
    @visa_application_forms = VisaApplicationForm.all

INSERT INTO "visa_application_forms" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "sadfghjkl;"], ["created_at", "2018-12-07 08:52:40.582029"], ["updated_at", "2018-12-07 08:52:40.582029"]]
---
  def create
    @visa_application_form = VisaApplicationForm.new(visa_application_form_params)

    respond_to do |format|
      if @visa_application_form.save

SELECT  "visa_application_forms".* FROM "visa_application_forms" WHERE "visa_application_forms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_visa_application_form
      @visa_application_form = VisaApplicationForm.find(params[:id])