app/controllers/visa_applications_controller.rb

SELECT  "visa_applications".* FROM "visa_applications" WHERE "visa_applications"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_visa_application
      @visa_application = VisaApplication.find(params[:id])