app/controllers/visa_app_ones_controller.rb

  def index
    @visa_app_ones = VisaAppOne.all
---
SELECT "visa_app_ones".* FROM "visa_app_ones"

  def create
    @visa_app_one = VisaAppOne.new(visa_app_one_params)

    respond_to do |format|
      if @visa_app_one.save
---
INSERT INTO "visa_app_ones" ("q1", "created_at", "updated_at") VALUES (?, ?, ?)  [["q1", "weyuioptre"], ["created_at", "2018-12-07 08:30:53.472742"], ["updated_at", "2018-12-07 08:30:53.472742"]]

  def update_step_2
    respond_to do |format|
      if @visa_app_one.update(visa_app_one_params)
---
UPDATE "visa_app_ones" SET "q2" = ?, "updated_at" = ? WHERE "visa_app_ones"."id" = ?  [["q2", "tioytrfghjklv"], ["updated_at", "2018-12-07 08:30:28.946858"], ["id", 2]]

    def set_visa_app_one
      @visa_app_one = VisaAppOne.find(params[:id])
---
SELECT  "visa_app_ones".* FROM "visa_app_ones" WHERE "visa_app_ones"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]