app/controllers/visa_application_form_steps_controller.rb

SELECT "visa_application_form_steps".* FROM "visa_application_form_steps"
---
  def index
    @visa_application_form_steps = VisaApplicationFormStep.all

INSERT INTO "visa_application_form_steps" ("visa_application_form_id", "step_id", "position", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["visa_application_form_id", 1], ["step_id", 1], ["position", 1], ["created_at", "2018-12-07 08:53:39.079997"], ["updated_at", "2018-12-07 08:53:39.079997"]]
---
  def create
    @visa_application_form_step = VisaApplicationFormStep.new(visa_application_form_step_params)

    respond_to do |format|
      if @visa_application_form_step.save

SELECT  "visa_application_form_steps".* FROM "visa_application_form_steps" WHERE "visa_application_form_steps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_visa_application_form_step
      @visa_application_form_step = VisaApplicationFormStep.find(params[:id])